app/views/friendships/index.html.erb

SELECT  1 AS one FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 2], ["friend_id", 1], ["LIMIT", 1]]
---
        <td>
          <% unless current_user.friendships.exists?(friend_id: user.id) %>