app/controllers/friendships_controller.rb

  def create
    @friend = current_user.friendships.build(friend_id: params[:friend_id])
    if @friend.save
---
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["friend_id", 1], ["created_at", 2016-07-16 04:47:29 UTC], ["updated_at", 2016-07-16 04:47:29 UTC]]

  def destroy
    @friendship = current_user.friendships.find params[:id]
    @friendship.destroy
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 ORDER BY "friendships"."id" ASC LIMIT $3  [["user_id", 2], ["friend_id", 8], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 8]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]