app/controllers/messages_controller.rb

  def show
    @message = Message.find params[:id]
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def new
    if params[:user_id]
      @recipient = User.find params[:user_id]
---
SELECT  "users".* FROM "users" WHERE ("users"."id" != 2) ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def create
    @message = Message.new(message_params)
    @message.sender = current_user
    if @message.save
---
INSERT INTO "messages" ("sender_id", "recipient_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sender_id", 2], ["recipient_id", 1], ["body", "123123"], ["created_at", 2016-07-15 08:15:00 UTC], ["updated_at", 2016-07-15 08:15:00 UTC]]