app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)
    @message.sender = current_user
    @message.recipient = User.find params[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]