app/controllers/sessions_controller.rb

  def create
    if @user = User.find_by(email: params[:email]) and @user.authenticate(params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ken@mail.com"], ["LIMIT", 1]]